## Pandas 
** Group by functionality ** 
** Merging, Joining and Concatenation **

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Company' : ['GOOG', 'GOOG', 'MSFT','MSFT','FB','FB'], 
        'Person' : ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales' : [200, 120, 340,124, 243,350]}

In [3]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [4]:
df.groupby('Company').sum()  # sum of all the company sales in the table.

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [5]:
df.groupby('Company').mean()  # mean of values

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [13]:
df.groupby('Company').std() # standard deviation

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [6]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [7]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [17]:
df.groupby('Company').describe().transpose()

Company    FB                                                         GOOG  \
        count   mean        std    min     25%    50%     75%    max count
Sales     2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0   2.0

Company         ...                  MSFT                                   \
          mean  ...      75%    max count   mean         std    min    25%
Sales    160.0  ...    180.0  200.0   2.0  232.0  152.735065  124.0  178.0

Company
           50%    75%    max
Sales    232.0  286.0  340.0

[1 rows x 24 columns]

In [12]:
df.groupby('Company').describe().transpose()['MSFT']

       count   mean         std    min    25%    50%    75%    max
Sales    2.0  232.0  152.735065  124.0  178.0  232.0  286.0  340.0

## Pandas
** Merging , Concatenation and Joining **

In [9]:
df1 = pd.DataFrame({ 'A' : ['A0','A1','A2','A3'], 
                    'B' : ['B0','B1', 'B2','B3'], 
                    'C' : ['C0','C1', 'C2','C3'],
                    'D' : ['D0','D1', 'D2','D3']}, index = [0,1,2,3])

In [10]:
df2 = pd.DataFrame({ 'A' : ['A4','A5','A6','A7'], 
                    'B' : ['B4','B6', 'B6','B7'], 
                    'C' : ['C4','C5', 'C6','C7'],
                    'D' : ['D4','D5', 'D6','D7']}, index = [4,5,6,7])

In [11]:
df3 = pd.DataFrame({ 'A' : ['A8','A9','A10','A11'], 
                    'B' : ['B9','B9', 'B10','B11'], 
                    'C' : ['C8','C9', 'C10','C11'],
                    'D' : ['D8','D9', 'D10','D11']}, index = [8,9,10,11])

In [12]:
# concatenate the frames 
pd.concat([df1, df2, df3])   # concatenate on x axis

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B6   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B9   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [13]:
pd.concat([df1, df2, df3], axis=1) # concatenate on y axis.

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B6   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B9   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [14]:
left = pd.DataFrame({'key' : ['K1','K2', 'K3'], 
                     'A' : ['A1', 'A2', 'A3'], 
                     'B' : ['B1', 'B2', 'B3']})

In [15]:
right = pd.DataFrame({'key' : ['K1','K2', 'K3'], 
                     'C' : ['C1', 'C2', 'C3'], 
                     'D' : ['D1', 'D2', 'D3']})

## Merge Operation

In [33]:
pd.merge(left, right, how='inner', on='key') ## very similar to the joining on SQL statements

    A   B key   C   D
0  A1  B1  K1  C1  D1
1  A2  B2  K2  C2  D2
2  A3  B3  K3  C3  D3

In [40]:
left1 = pd.DataFrame({'key1' : ['K1','K2', 'K3'],
                     'key2' : ['K0', 'K1', 'K0'], 
                     'A' : ['A1', 'A2', 'A3'], 
                     'B' : ['B1', 'B2', 'B3']})
right1 = pd.DataFrame({'key1' : ['K1','K2', 'K3'], 
                     'key2' : ['K0','K0', 'K0'],
                     'C' : ['C1', 'C2', 'C3'], 
                     'D' : ['D1', 'D2', 'D3']})

In [41]:
pd.merge(left1, right1, on=['key1', 'key2'])

    A   B key1 key2   C   D
0  A1  B1   K1   K0  C1  D1
1  A3  B3   K3   K0  C3  D3

In [42]:
pd.merge(left1, right1, how='outer',  on=['key1', 'key2'])

     A    B key1 key2    C    D
0   A1   B1   K1   K0   C1   D1
1   A2   B2   K2   K1  NaN  NaN
2   A3   B3   K3   K0   C3   D3
3  NaN  NaN   K2   K0   C2   D2

In [43]:
pd.merge(left1, right1, how='left',  on=['key1', 'key2'])  # analogous to left outer join in SQL.

    A   B key1 key2    C    D
0  A1  B1   K1   K0   C1   D1
1  A2  B2   K2   K1  NaN  NaN
2  A3  B3   K3   K0   C3   D3

In [44]:
pd.merge(left1, right1, how='right',  on=['key1', 'key2']) # analogoud to right outer join in SQL

     A    B key1 key2   C   D
0   A1   B1   K1   K0  C1  D1
1   A3   B3   K3   K0  C3  D3
2  NaN  NaN   K2   K0  C2  D2

In [45]:
left2 = pd.DataFrame({'A' : ['A1', 'A2', 'A3'], 
                     'B' : ['B1', 'B2', 'B3']}, index = ['K0', 'K1', 'K2'])
right2 = pd.DataFrame({'C' : ['C1', 'C2', 'C3'], 
                     'D' : ['D1', 'D2', 'D3']}, index = ['K0', 'K2', 'K3'])

## Joining 
** Joining function will help combine two columns of two potentailly different data frames into a single frame. **

In [47]:
left2.join(right2, how='inner')

     A   B   C   D
K0  A1  B1  C1  D1
K2  A3  B3  C2  D2

In [48]:
right2.join(left2)

     C   D    A    B
K0  C1  D1   A1   B1
K2  C2  D2   A3   B3
K3  C3  D3  NaN  NaN

In [49]:
left2.join(right2, how='outer') # outer join will join all rows and mark the ones that don't match with NaN

      A    B    C    D
K0   A1   B1   C1   D1
K1   A2   B2  NaN  NaN
K2   A3   B3   C2   D2
K3  NaN  NaN   C3   D3